Show / Hide Table of Contents
Class TimePoint
Point on time axis
Inheritance
System.Object
OpenObject
TimePoint
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Concrete
Assembly: IdeaRS.OpenModel.dll
Syntax
public class TimePoint : OpenObject
Constructors
Improve this Doc   View Source
TimePoint()
Constructor
Declaration
public TimePoint()
Properties
Improve this Doc   View Source
Age
Age
Declaration
public double Age { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
AllowCheckInAgeLess3Days
true to allow chec in age less 3 days
Declaration
public bool AllowCheckInAgeLess3Days { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
Description
Description
Declaration
public string Description { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
Fix2DRotation
true to fix around Y axis ( Mz is not taken into account )
Declaration
public bool Fix2DRotation { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
LastConstructionStage
Last construction stage - Time of the start of cyclic loading for fatigue check
Declaration
public bool LastConstructionStage { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
Name
Name of time point
Declaration
public string Name { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
Prestressing
Prestressing
Declaration
public bool Prestressing { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
Stage
Stage
Declaration
public bool Stage { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
Time
Time
Declaration
public double Time { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source